In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\HP\OneDrive\Desktop\py-master\ML\5_one_hot_encoding\homeprices.csv")
df.head(8)

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000
5     west windsor  2600  585000
6     west windsor  2800  615000
7     west windsor  3300  650000

In [3]:
dummy_columns=pd.get_dummies(df.town)

In [4]:
merge_columns=pd.concat([df,dummy_columns],axis='columns')
merge_columns.head(8)

              town  area   price  monroe township  robinsville  west windsor
0  monroe township  2600  550000                1            0             0
1  monroe township  3000  565000                1            0             0
2  monroe township  3200  610000                1            0             0
3  monroe township  3600  680000                1            0             0
4  monroe township  4000  725000                1            0             0
5     west windsor  2600  585000                0            0             1
6     west windsor  2800  615000                0            0             1
7     west windsor  3300  650000                0            0             1

In [5]:
merge_columns=merge_columns.drop(['town','monroe township'],axis='columns')

In [6]:
merge_columns.head(8)

   area   price  robinsville  west windsor
0  2600  550000            0             0
1  3000  565000            0             0
2  3200  610000            0             0
3  3600  680000            0             0
4  4000  725000            0             0
5  2600  585000            0             1
6  2800  615000            0             1
7  3300  650000            0             1

In [7]:
from sklearn import linear_model

In [8]:
regression=linear_model.LinearRegression()

In [9]:
X=merge_columns.drop(['price'],axis='columns')

In [10]:
X

    area  robinsville  west windsor
0   2600            0             0
1   3000            0             0
2   3200            0             0
3   3600            0             0
4   4000            0             0
5   2600            0             1
6   2800            0             1
7   3300            0             1
8   3600            0             1
9   2600            1             0
10  2900            1             0
11  3100            1             0
12  3600            1             0

In [11]:
Y=merge_columns.price
Y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [12]:
regression.fit(X,Y)

LinearRegression()

In [14]:
regression.predict([[2800,1,0]])

C:\Users\HP\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([590775.63964739])

In [16]:
regression.score(X,Y)

0.9573929037221872

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
le=LabelEncoder()

In [20]:
dfle=df
dfle.town=le.fit_transform(dfle.town)

In [22]:
dfle

    town  area   price
0      0  2600  550000
1      0  3000  565000
2      0  3200  610000
3      0  3600  680000
4      0  4000  725000
5      2  2600  585000
6      2  2800  615000
7      2  3300  650000
8      2  3600  710000
9      1  2600  575000
10     1  2900  600000
11     1  3100  620000
12     1  3600  695000

In [37]:
x_encode=dfle[['town']]

In [39]:
x_encode

    town
0      0
1      0
2      0
3      0
4      0
5      2
6      2
7      2
8      2
9      1
10     1
11     1
12     1

In [40]:
y=dfle[['price']].values
y

array([[550000],
       [565000],
       [610000],
       [680000],
       [725000],
       [585000],
       [615000],
       [650000],
       [710000],
       [575000],
       [600000],
       [620000],
       [695000]], dtype=int64)

In [41]:
from sklearn.preprocessing import OneHotEncoder
one_hot_encode=OneHotEncoder()

In [43]:
x_encode=one_hot_encode.fit_transform(x_encode).toarray()

In [44]:
x_encode

array([[1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.]])

In [57]:
x_encode=pd.DataFrame(x_encode)

In [64]:
x=pd.concat([x_encode,dfle[['area']]],axis='columns')

In [65]:
x=x.values

In [66]:
x

array([[1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.0e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.2e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.9e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.1e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.6e+03]])

In [67]:
x=x[:,1:]

In [68]:
x

array([[0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 3.2e+03],
       [0.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 2.9e+03],
       [1.0e+00, 0.0e+00, 3.1e+03],
       [1.0e+00, 0.0e+00, 3.6e+03]])

In [69]:
regression.fit(x,y)

LinearRegression()

In [71]:
regression.predict([[1,0,2800]])

array([[590775.63964739]])